var levels = [ {
	"level" : 1,
	"xp" : 0,
	"title" : "新人渔民"
}, {
	"level" : 2,
	"xp" : 50000,
	"title" : "新人渔民"
}, {
	"level" : 3,
	"xp" : 150000,
	"title" : "新人渔民"
}, {
	"level" : 4,
	"xp" : 450000,
	"title" : "新人渔民"
}, {
	"level" : 5,
	"xp" : 1350000,
	"title" : "新人渔民"
}, {
	"level" : 6,
	"xp" : 4050000,
	"title" : "新人渔民"
}, {
	"level" : 7,
	"xp" : 12150000,
	"title" : "新人渔民"
}, {
	"level" : 8,
	"xp" : 36450000,
	"title" : "新人渔民"
}, {
	"level" : 9,
	"xp" : 109350000,
	"title" : "新人渔民"
}, {
	"level" : 10,
	"xp" : 328050000,
	"title" : "新人渔民"
}, {
	"level" : 11,
	"xp" : 492075000,
	"title" : "渔民临时工"
}, {
	"level" : 12,
	"xp" : 738112500,
	"title" : "渔民临时工"
}, {
	"level" : 13,
	"xp" : 1107168750,
	"title" : "渔民临时工"
}, {
	"level" : 14,
	"xp" : 1660753125,
	"title" : "渔民临时工"
}, {
	"level" : 15,
	"xp" : 2491129688,
	"title" : "渔民临时工"
}, {
	"level" : 16,
	"xp" : 3612138047,
	"title" : "渔民临时工"
},
{
	"level" : 17,
	"xp" : 5237600168,
	"title" : "渔民临时工"
}, {
	"level" : 18,
	"xp" : 7594520244,
	"title" : "渔民临时工"
}, {
	"level" : 19,
	"xp" : 11012054353,
	"title" : "渔民临时工"
},

{
	"level" : 20,
	"xp" : 15967478812,
	"title" : "渔民临时工"
}, {
	"level" : 21,
	"xp" : 20757722456,
	"title" : "转正渔民"
}, {
	"level" : 22,
	"xp" : 26985039192,
	"title" : "转正渔民"
},

{
	"level" : 23,
	"xp" : 35080550950,
	"title" : "转正渔民"
}, {
	"level" : 24,
	"xp" : 45604716235,
	"title" : "转正渔民"
}, {
	"level" : 25,
	"xp" : 59286131106,
	"title" : "转正渔民"
},

{
	"level" : 26,
	"xp" : 71143357327,
	"title" : "资深渔民"
}, {
	"level" : 27,
	"xp" : 85372028792,
	"title" : "资深渔民"
}, {
	"level" : 28,
	"xp" : 102446434551,
	"title" : "资深渔民"
},

{
	"level" : 29,
	"xp" : 122935721461,
	"title" : "资深渔民"
}, {
	"level" : 30,
	"xp" : 147522865753,
	"title" : "资深渔民"
}, {
	"level" : 31,
	"xp" : 165225609643,
	"title" : "深海猎手"
},

{
	"level" : 32,
	"xp" : 185052682801,
	"title" : "深海猎手"
}, {
	"level" : 33,
	"xp" : 207259004737,
	"title" : "深海猎手"
}, {
	"level" : 34,
	"xp" : 232130085305,
	"title" : "深海猎手"
},

{
	"level" : 35,
	"xp" : 259985695542,
	"title" : "深海猎手"
}, {
	"level" : 36,
	"xp" : 288584122051,
	"title" : "抓鱼狂人"
}, {
	"level" : 37,
	"xp" : 320328375477,
	"title" : "抓鱼狂人"
},

{
	"level" : 38,
	"xp" : 355564496779,
	"title" : "抓鱼狂人"
}, {
	"level" : 39,
	"xp" : 394676591425,
	"title" : "抓鱼狂人"
}, {
	"level" : 40,
	"xp" : 438091016482,
	"title" : "抓鱼狂人"
},

{
	"level" : 41,
	"xp" : 459995567306,
	"title" : "捕鱼神怪"
}, {
	"level" : 42,
	"xp" : 482995345671,
	"title" : "捕鱼神怪"
}, {
	"level" : 43,
	"xp" : 507145112955,
	"title" : "捕鱼神怪"
},

{
	"level" : 44,
	"xp" : 532502368602,
	"title" : "捕鱼神怪"
}, {
	"level" : 45,
	"xp" : 559127487032,
	"title" : "捕鱼神怪"
}, {
	"level" : 46,
	"xp" : 587083861384,
	"title" : "破浪使徒"
},

{
	"level" : 47,
	"xp" : 616438054453,
	"title" : "破浪使徒"
}, {
	"level" : 48,
	"xp" : 647259957176,
	"title" : "破浪使徒"
}, {
	"level" : 49,
	"xp" : 679622955035,
	"title" : "破浪使徒"
},

{
	"level" : 50,
	"xp" : 713604102786,
	"title" : "破浪使徒"
}, {
	"level" : 51,
	"xp" : 727876184842,
	"title" : "猎鱼巨魔"
}, {
	"level" : 52,
	"xp" : 742433708539,
	"title" : "猎鱼巨魔"
},

{
	"level" : 53,
	"xp" : 757282382710,
	"title" : "猎鱼巨魔"
}, {
	"level" : 54,
	"xp" : 772428030364,
	"title" : "猎鱼巨魔"
}, {
	"level" : 55,
	"xp" : 787876590971,
	"title" : "猎鱼巨魔"
},

{
	"level" : 56,
	"xp" : 795755356881,
	"title" : "远洋暴君"
}, {
	"level" : 57,
	"xp" : 803712910450,
	"title" : "远洋暴君"
}, {
	"level" : 58,
	"xp" : 811750039554,
	"title" : "远洋暴君"
},

{
	"level" : 59,
	"xp" : 819867539950,
	"title" : "远洋暴君"
}, {
	"level" : 60,
	"xp" : 828066215349,
	"title" : "远洋暴君"
} ];


function getUserlevel(exp){
	if(exp <= 0){
		return levels[0];
	}
	for(var i=0;i<levels.length;i++){
		exp -= levels[i].xp;
		if(exp<0){
			return levels[i-1];
			break;
		}else if(exp==0){
			return levels[i];
			break;
		}
	}
}
